In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\aayush\anaconda3\lib\site-packages (2.2.9)

In [6]:
import mysql.connector  		#importing database

database = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
  database = "pythonclass3pm",
)
db = database.cursor()

In [4]:
# db.execute("CREATE DATABASE pythons11")

In [8]:
db.execute("SELECT * FROM student")
result =db.fetchall()
print(result)

[(1, 'Rakesh KC', 78, 89, 56, 98, 89, 456, 87.3, 'A+'), (2, 'Sabin', 89, 45, 90, 76, 67, 89, 84.3, 'A'), (3, 'Sabina', 89, 45, 90, 76, 67, 82, 83.3, 'A')]

In [9]:
db.execute("SELECT sn,name,total,grade FROM student")
result =db.fetchall()
print(result)

[(1, 'Rakesh KC', 456, 'A+'), (2, 'Sabin', 89, 'A'), (3, 'Sabina', 82, 'A')]

In [10]:
sql = '''INSERT INTO student( name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('Sabin',89,79,90,91,78,420,84.7,'A')'''
db.execute(sql)
database.commit()

In [13]:
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter physics = "))
    chemistry = int(input("Enter chemistry = "))
    math = int(input("Enter math = "))
    english = int(input("Enter english = "))
    nepali = int(input("Enter nepali =  "))
    total = physics + chemistry + math + english + nepali
    per = total/5
    if per > 80:
        grade = "A"
    elif per > 60:
        grade = "B"
    elif per > 45:
        grade = "C"
    else:
        grade = "F"
        
    sql = f'''INSERT INTO student( name, physics, chemistry, math, english, nepali, total, per, grade) 
            VALUES ('{name}',{physics},{chemistry},{math},{english},{nepali},{total},{per},'{grade}')'''
    db.execute(sql)
        
database.commit()

Enter n = 2
Enter name = Ram
Enter physics = 78
Enter chemistry = 90
Enter math = 87
Enter english = 78
Enter nepali =  87
Enter name = Shyam
Enter physics = 90
Enter chemistry = 89
Enter math = 98
Enter english = 78
Enter nepali =  87

In [14]:
db.execute("SELECT * FROM student WHERE grade = 'A' ")
result =db.fetchall()
print(result)

[(2, 'Sabin', 89, 45, 90, 76, 67, 89, 84.3, 'A'), (3, 'Sabina', 89, 45, 90, 76, 67, 82, 83.3, 'A'), (6, 'Sabin', 89, 79, 90, 91, 78, 420, 84.7, 'A')]

In [17]:
db.execute("SELECT * FROM student WHERE grade = 'A' and math > 85")
result =db.fetchall()
print(result)

[(2, 'Sabin', 89, 45, 90, 76, 67, 89, 84.3, 'A'), (3, 'Sabina', 89, 45, 90, 76, 67, 82, 83.3, 'A'), (6, 'Sabin', 89, 79, 90, 91, 78, 420, 84.7, 'A')]

In [19]:
sql = "DELETE FROM student WHERE grade = 'A+'"
db.execute(sql)
database.commit()

In [22]:
sql = "UPDATE student SET name = 'Ram Prasad' WHERE name = 'Ram'"

db.execute(sql)

database.commit()